"Prevent accidental quitting" = "Impedisci chiusura accidentale";
"Monthly" = "Mensilmente";
"Check for update immediately" = "Verifica ora la presenza di aggiornamenti";
"Add Quicksilver to your login items" = "Aggiungi Quicksilver agli elementi di login";
"Download updates in the background" = "Scarica gli aggiornamenti in background";
"Restart immediately" = "Riavvia subito";
"Warn before quitting" = "Avvisa prima di chiudere";
"Normal" = "Normale";
"Run Setup" = "Esegui setup";
"Enable update checking" = "Abilita il controllo aggiornamenti";
"Now" = "Adesso";
"⌽" = "⌽";